cnf/app/Models/CareerModel.php

SELECT `c`.*, `ct`.`title`, `ct`.`description`, `ct`.`requirements`, `ct`.`benefits`
FROM `careers` `c`
LEFT JOIN `career_translations` `ct` ON `c`.`id` = `ct`.`career_id` AND `ct`.`language_id` = 1
WHERE `c`.`is_active` = 1
AND (`c`.`deadline_date` IS NULL OR c.deadline_date >= CURDATE())
ORDER BY `c`.`is_urgent` DESC, `c`.`posted_date` DESC
---
    public function getActiveCareers($languageCode = 'en')
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $query = $this->db->table('careers c')
            ->select('c.*, ct.title, ct.description, ct.requirements, ct.benefits')
            ->join('career_translations ct',
                   "c.id = ct.career_id AND ct.language_id = $languageId",
                   'left')
            ->where('c.is_active', 1)
            ->where('(c.deadline_date IS NULL OR c.deadline_date >= CURDATE())')
            ->orderBy('c.is_urgent', 'DESC')
            ->orderBy('c.posted_date', 'DESC')
            ->get();