cnf/app/Models/CategoryModel.php

SELECT `c`.*, `ct`.`name`, `ct`.`description`
FROM `categories` `c`
LEFT JOIN `category_translations` `ct` ON `c`.`id` = `ct`.`category_id` AND `ct`.`language_id` = 1
WHERE `c`.`is_active` = 1
AND `c`.`parent_id` IS NULL
ORDER BY `c`.`display_order` ASC, `c`.`id` ASC
---
    public function getActiveCategories($languageCode = 'en', $parentId = null)
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $builder = $this->db->table('categories c')
            ->select('c.*, ct.name, ct.description')
            ->join('category_translations ct',
                   "c.id = ct.category_id AND ct.language_id = $languageId",
                   'left')
            ->where('c.is_active', 1);

        if ($parentId !== null) {
            $builder->where('c.parent_id', $parentId);
        } else {
            $builder->where('c.parent_id IS NULL');
        }

        return $builder->orderBy('c.display_order', 'ASC')
                      ->orderBy('c.id', 'ASC')
                      ->get()
                      ->getResultArray();