cnf/app/Models/CompanyInfoModel.php

    public function getCompanyInfo($languageCode = 'en')
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            // Fallback to English
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $query = $this->db->table('company_info ci')
            ->select('ci.info_key,
                     COALESCE(cit.translated_value, ci.info_value) as info_value,
                     ci.info_type')
            ->join('company_info_translations cit',
                   "ci.id = cit.company_info_id AND cit.language_id = $languageId",
                   'left')
            ->orderBy('ci.info_key', 'ASC')
            ->get();
---
SELECT `ci`.`info_key`, COALESCE(cit.translated_value, ci.info_value) as info_value, `ci`.`info_type`
FROM `company_info` `ci`
LEFT JOIN `company_info_translations` `cit` ON `ci`.`id` = `cit`.`company_info_id` AND `cit`.`language_id` = 1
ORDER BY `ci`.`info_key` ASC