cnf/app/Models/GalleryModel.php

SELECT `g`.*, `gt`.`title` as `gallery_title`, `gt`.`description`, `gt`.`alt_text`
FROM `galleries` `g`
LEFT JOIN `gallery_translations` `gt` ON `g`.`id` = `gt`.`gallery_id` AND `gt`.`language_id` = 1
WHERE `g`.`is_active` = 1
ORDER BY `g`.`display_order` ASC, `g`.`created_at` DESC
 LIMIT 8
---
    public function getFeaturedGallery($languageCode = 'en', $limit = 8)
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $query = $this->db->table('galleries g')
            ->select('g.*, gt.title as gallery_title, gt.description, gt.alt_text')
            ->join('gallery_translations gt',
                   "g.id = gt.gallery_id AND gt.language_id = $languageId",
                   'left')
            ->where('g.is_active', 1)
            ->orderBy('g.display_order', 'ASC')
            ->orderBy('g.created_at', 'DESC')
            ->limit($limit)
            ->get();