cnf/app/Models/LanguageModel.php

SELECT *
FROM `languages`
WHERE `code` = 'id'
 LIMIT 1
---
    public function getLanguageByCode($code)
    {
        return $this->where('code', $code)->first();

SELECT *
FROM `languages`
WHERE `code` = 'en'
 LIMIT 1
---
    public function getLanguageIdByCode($code)
    {
        $language = $this->where('code', $code)->first();