cnf/app/Models/ProductModel.php

SELECT `p`.*, `pt`.`name`, `pt`.`short_description`, `pt`.`description`
FROM `products` `p`
LEFT JOIN `product_translations` `pt` ON `p`.`id` = `pt`.`product_id` AND `pt`.`language_id` = 1
WHERE `p`.`is_featured` = 1
AND `p`.`is_active` = 1
ORDER BY `p`.`display_order` ASC, `p`.`created_at` DESC
 LIMIT 6
---
    public function getFeaturedProducts($languageCode = 'en', $limit = 6)
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $query = $this->db->table('products p')
            ->select('p.*, pt.name, pt.short_description, pt.description')
            ->join('product_translations pt',
                   "p.id = pt.product_id AND pt.language_id = $languageId",
                   'left')
            ->where('p.is_featured', 1)
            ->where('p.is_active', 1)
            ->orderBy('p.display_order', 'ASC')
            ->orderBy('p.created_at', 'DESC')
            ->limit($limit)
            ->get();

SELECT `p`.*, `pt`.`name`, `pt`.`short_description`, `pt`.`description`
FROM `products` `p`
LEFT JOIN `product_translations` `pt` ON `p`.`id` = `pt`.`product_id` AND `pt`.`language_id` = 1
WHERE `p`.`category` = 'upholstery'
AND `p`.`is_active` = 1
ORDER BY `p`.`display_order` ASC, `p`.`created_at` DESC
 LIMIT 4
---
    public function getProductsByCategory($category, $languageCode = 'en', $limit = null)
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $builder = $this->db->table('products p')
            ->select('p.*, pt.name, pt.short_description, pt.description')
            ->join('product_translations pt',
                   "p.id = pt.product_id AND pt.language_id = $languageId",
                   'left')
            ->where('p.category', $category)
            ->where('p.is_active', 1)
            ->orderBy('p.display_order', 'ASC')
            ->orderBy('p.created_at', 'DESC');

        if ($limit) {
            $builder->limit($limit);
        }

        return $builder->get()->getResultArray();

SELECT `p`.*, `pt`.`name`, `pt`.`short_description`
FROM `products` `p`
LEFT JOIN `product_translations` `pt` ON `p`.`id` = `pt`.`product_id` AND `pt`.`language_id` = 1
WHERE `p`.`is_new` = 1
AND `p`.`is_active` = 1
ORDER BY `p`.`created_at` DESC
 LIMIT 4
---
    public function getNewArrivals($languageCode = 'en', $limit = 4)
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $query = $this->db->table('products p')
            ->select('p.*, pt.name, pt.short_description')
            ->join('product_translations pt',
                   "p.id = pt.product_id AND pt.language_id = $languageId",
                   'left')
            ->where('p.is_new', 1)
            ->where('p.is_active', 1)
            ->orderBy('p.created_at', 'DESC')
            ->limit($limit)
            ->get();

SELECT `p`.*, `pt`.`name`, `pt`.`short_description`
FROM `products` `p`
LEFT JOIN `product_translations` `pt` ON `p`.`id` = `pt`.`product_id` AND `pt`.`language_id` = 1
WHERE `p`.`is_bestseller` = 1
AND `p`.`is_active` = 1
ORDER BY `p`.`display_order` ASC
 LIMIT 4
---
    public function getBestsellers($languageCode = 'en', $limit = 4)
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $query = $this->db->table('products p')
            ->select('p.*, pt.name, pt.short_description')
            ->join('product_translations pt',
                   "p.id = pt.product_id AND pt.language_id = $languageId",
                   'left')
            ->where('p.is_bestseller', 1)
            ->where('p.is_active', 1)
            ->orderBy('p.display_order', 'ASC')
            ->limit($limit)
            ->get();