cnf/app/Models/ServiceModel.php

SELECT `s`.*, `st`.`title`, `st`.`description`
FROM `services` `s`
LEFT JOIN `service_translations` `st` ON `s`.`id` = `st`.`service_id` AND `st`.`language_id` = 1
WHERE `s`.`is_active` = 1
ORDER BY `s`.`service_order` ASC
---
    public function getActiveServices($languageCode = 'en')
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $query = $this->db->table('services s')
            ->select('s.*, st.title, st.description')
            ->join('service_translations st',
                   "s.id = st.service_id AND st.language_id = $languageId",
                   'left')
            ->where('s.is_active', 1)
            ->orderBy('s.service_order', 'ASC')
            ->get();