cnf/app/Models/SettingsModel.php

    public function getSettingsByCategory($category)
    {
        $settings = $this->where('category', $category)->findAll();
---
SELECT *
FROM `settings`
WHERE `category` = 'general'