cnf/app/Models/TestimonialModel.php

    public function getFeaturedTestimonials($languageCode = 'en', $limit = 5)
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            $languageId = $languageModel->getLanguageIdByCode('en');
        }

        $query = $this->db->table('testimonials t')
            ->select('t.*, tt.testimonial_text')
            ->join('testimonial_translations tt',
                   "t.id = tt.testimonial_id AND tt.language_id = $languageId",
                   'left')
            ->where('t.is_featured', 1)
            ->where('t.is_active', 1)
            ->orderBy('t.display_order', 'ASC')
            ->orderBy('t.created_at', 'DESC')
            ->limit($limit)
            ->get();
---
SELECT `t`.*, `tt`.`testimonial_text`
FROM `testimonials` `t`
LEFT JOIN `testimonial_translations` `tt` ON `t`.`id` = `tt`.`testimonial_id` AND `tt`.`language_id` = 1
WHERE `t`.`is_featured` = 1
AND `t`.`is_active` = 1
ORDER BY `t`.`display_order` ASC, `t`.`created_at` DESC
 LIMIT 5