cnf/app/Models/TranslationModel.php

    public function getAllTranslations($languageCode = 'en')
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            return [];
        }

        $query = $this->db->table('translations t')
            ->select('ck.key_name, t.translation_text')
            ->join('content_keys ck', 'ck.id = t.content_key_id')
            ->where('t.language_id', $languageId)
            ->orderBy('ck.category', 'ASC')
            ->orderBy('ck.key_name', 'ASC')
            ->get();
---
SELECT `ck`.`key_name`, `t`.`translation_text`
FROM `translations` `t`
JOIN `content_keys` `ck` ON `ck`.`id` = `t`.`content_key_id`
WHERE `t`.`language_id` = '1'
ORDER BY `ck`.`category` ASC, `ck`.`key_name` ASC

    public function getTranslation($key, $languageCode = 'en')
    {
        $languageModel = new LanguageModel();
        $languageId = $languageModel->getLanguageIdByCode($languageCode);

        if (!$languageId) {
            return $key;
        }

        $query = $this->db->table('translations t')
            ->select('t.translation_text')
            ->join('content_keys ck', 'ck.id = t.content_key_id')
            ->where('ck.key_name', $key)
            ->where('t.language_id', $languageId)
            ->get();
---
SELECT `t`.`translation_text`
FROM `translations` `t`
JOIN `content_keys` `ck` ON `ck`.`id` = `t`.`content_key_id`
WHERE `ck`.`key_name` = 'about_story'
AND `t`.`language_id` = '2'